## staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 19 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_stream.newrelic_metric_stream[0]`             |
|        | `aws_iam_policy.newrelic_aws_permissions[0]`                         |
|        | `aws_iam_role.firehose_newrelic_role[0]`                             |
|        | `aws_iam_role.metric_stream_to_firehose[0]`                          |
|        | `aws_iam_role.newrelic_aws_role[0]`                                  |
|        | `aws_iam_role.newrelic_configuration_recorder[0]`                    |
|        | `aws_iam_role_policy.metric_stream_to_firehose[0]`                   |
|        | `aws_iam_role_policy.newrelic_configuration_recorder_s3[0]`          |
|        | `aws_iam_role_policy_attachment.newrelic_aws_policy_attach[0]`       |
|        | `aws_iam_role_policy_attachment.newrelic_configuration_recorder[0]`  |
|        | `aws_kinesis_firehose_delivery_stream.newrelic_firehose_stream[0]`   |
|        | `aws_s3_bucket.newrelic_aws_bucket[0]`                               |
|        | `aws_s3_bucket.newrelic_configuration_recorder_s3[0]`                |
|        | `aws_s3_bucket_ownership_controls.newrelic_ownership_controls[0]`    |
|        | `newrelic_api_access_key.newrelic_aws_access_key[0]`                 |
|        | `newrelic_cloud_aws_integrations.newrelic_cloud_integration_pull[0]` |
|        | `newrelic_cloud_aws_link_account.newrelic_cloud_integration_pull[0]` |
|        | `newrelic_cloud_aws_link_account.newrelic_cloud_integration_push[0]` |
|        | `random_string.s3-bucket-name[0]`                                    |
| update | `aws_sns_sms_preferences.update-sms-prefs-us-west-2`                 |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/17836994586).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:48:03.571 STDOUT terraform:   + create
17:48:03.571 STDOUT terraform:   ~ update in-place
17:48:03.571 STDOUT terraform: Terraform will perform the following actions:
17:48:03.571 STDOUT terraform:   # aws_cloudwatch_metric_stream.newrelic_metric_stream[0] will be created
17:48:03.571 STDOUT terraform:   + resource "aws_cloudwatch_metric_stream" "newrelic_metric_stream" {
17:48:03.571 STDOUT terraform:       + arn              = (known after apply)
17:48:03.571 STDOUT terraform:       + creation_date    = (known after apply)
17:48:03.571 STDOUT terraform:       + firehose_arn     = (known after apply)
17:48:03.572 STDOUT terraform:       + id               = (known after apply)
17:48:03.572 STDOUT terraform:       + last_update_date = (known after apply)
17:48:03.572 STDOUT terraform:       + name             = "newrelic-metric-stream-staging"
17:48:03.572 STDOUT terraform:       + name_prefix      = (known after apply)
17:48:03.572 STDOUT terraform:       + output_format    = "opentelemetry0.7"
17:48:03.572 STDOUT terraform:       + region           = "ca-central-1"
17:48:03.572 STDOUT terraform:       + role_arn         = (known after apply)
17:48:03.572 STDOUT terraform:       + state            = (known after apply)
17:48:03.572 STDOUT terraform:       + tags_all         = (known after apply)
17:48:03.572 STDOUT terraform:     }
17:48:03.572 STDOUT terraform:   # aws_iam_policy.newrelic_aws_permissions[0] will be created
17:48:03.572 STDOUT terraform:   + resource "aws_iam_policy" "newrelic_aws_permissions" {
17:48:03.572 STDOUT terraform:       + arn              = (known after apply)
17:48:03.572 STDOUT terraform:       + attachment_count = (known after apply)
17:48:03.572 STDOUT terraform:       + id               = (known after apply)
17:48:03.572 STDOUT terraform:       + name             = "NewRelicCloudStreamReadPermissions-staging"
17:48:03.572 STDOUT terraform:       + name_prefix      = (known after apply)
17:48:03.572 STDOUT terraform:       + path             = "/"
17:48:03.572 STDOUT terraform:       + policy           = jsonencode(
17:48:03.572 STDOUT terraform:             {
17:48:03.572 STDOUT terraform:               + Statement = [
17:48:03.572 STDOUT terraform:                   + {
17:48:03.572 STDOUT terraform:                       + Action   = [
17:48:03.572 STDOUT terraform:                           + "budgets:ViewBudget",
17:48:03.572 STDOUT terraform:                           + "cloudtrail:LookupEvents",
17:48:03.572 STDOUT terraform:                           + "config:BatchGetResourceConfig",
17:48:03.573 STDOUT terraform:                           + "config:ListDiscoveredResources",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeInternetGateways",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeVpcs",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeNatGateways",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeVpcEndpoints",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeSubnets",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeNetworkAcls",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeVpcAttribute",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeRouteTables",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeSecurityGroups",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeVpcPeeringConnections",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeNetworkInterfaces",
17:48:03.573 STDOUT terraform:                           + "ec2:DescribeVpnConnections",
17:48:03.573 STDOUT terraform:                           + "health:DescribeAffectedEntities",
17:48:03.573 STDOUT terraform:                           + "health:DescribeEventDetails",
17:48:03.573 STDOUT terraform:                           + "health:DescribeEvents",
17:48:03.573 STDOUT terraform:                           + "tag:GetResources",
17:48:03.573 STDOUT terraform:                           + "xray:BatchGet*",
17:48:03.573 STDOUT terraform:                           + "xray:Get*",
17:48:03.573 STDOUT terraform:                         ]
17:48:03.573 STDOUT terraform:                       + Effect   = "Allow"
17:48:03.573 STDOUT terraform:                       + Resource = "*"
17:48:03.573 STDOUT terraform:                     },
17:48:03.573 STDOUT terraform:                 ]
17:48:03.573 STDOUT terraform:               + Version   = "2012-10-17"
17:48:03.573 STDOUT terraform:             }
17:48:03.573 STDOUT terraform:         )
17:48:03.573 STDOUT terraform:       + policy_id        = (known after apply)
17:48:03.574 STDOUT terraform:       + tags_all         = (known after apply)
17:48:03.574 STDOUT terraform:         # (1 unchanged attribute hidden)
17:48:03.574 STDOUT terraform:     }
17:48:03.574 STDOUT terraform:   # aws_iam_role.firehose_newrelic_role[0] will be created
17:48:03.574 STDOUT terraform:   + resource "aws_iam_role" "firehose_newrelic_role" {
17:48:03.574 STDOUT terraform:       + arn                   = (known after apply)
17:48:03.574 STDOUT terraform:       + assume_role_policy    = jsonencode(
17:48:03.574 STDOUT terraform:             {
17:48:03.574 STDOUT terraform:               + Statement = [
17:48:03.574 STDOUT terraform:                   + {
17:48:03.574 STDOUT terraform:                       + Action    = "sts:AssumeRole"
17:48:03.574 STDOUT terraform:                       + Effect    = "Allow"
17:48:03.574 STDOUT terraform:                       + Principal = {
17:48:03.574 STDOUT terraform:                           + Service = "firehose.amazonaws.com"
17:48:03.574 STDOUT terraform:                         }
17:48:03.574 STDOUT terraform:                       + Sid       = ""
17:48:03.574 STDOUT terraform:                     },
17:48:03.574 STDOUT terraform:                 ]
17:48:03.574 STDOUT terraform:               + Version   = "2012-10-17"
17:48:03.574 STDOUT terraform:             }
17:48:03.574 STDOUT terraform:         )
17:48:03.574 STDOUT terraform:       + create_date           = (known after apply)
17:48:03.574 STDOUT terraform:       + force_detach_policies = false
17:48:03.574 STDOUT terraform:       + id                    = (known after apply)
17:48:03.574 STDOUT terraform:       + managed_policy_arns   = (known after apply)
17:48:03.574 STDOUT terraform:       + max_session_duration  = 3600
17:48:03.574 STDOUT terraform:       + name                  = "firehose_newrelic_role_staging"
17:48:03.574 STDOUT terraform:       + name_prefix           = (known after apply)
17:48:03.574 STDOUT terraform:       + path                  = "/"
17:48:03.574 STDOUT terraform:       + tags_all              = (known after apply)
17:48:03.574 STDOUT terraform:       + unique_id             = (known after apply)
17:48:03.574 STDOUT terraform:       + inline_policy (known after apply)
17:48:03.575 STDOUT terraform:     }
17:48:03.575 STDOUT terraform:   # aws_iam_role.metric_stream_to_firehose[0] will be created
17:48:03.575 STDOUT terraform:   + resource "aws_iam_role" "metric_stream_to_firehose" {
17:48:03.575 STDOUT terraform:       + arn                   = (known after apply)
17:48:03.575 STDOUT terraform:       + assume_role_policy    = jsonencode(
17:48:03.575 STDOUT terraform:             {
17:48:03.575 STDOUT terraform:               + Statement = [
17:48:03.575 STDOUT terraform:                   + {
17:48:03.575 STDOUT terraform:                       + Action    = "sts:AssumeRole"
17:48:03.575 STDOUT terraform:                       + Effect    = "Allow"
17:48:03.575 STDOUT terraform:                       + Principal = {
17:48:03.575 STDOUT terraform:                           + Service = "streams.metrics.cloudwatch.amazonaws.com"
17:48:03.575 STDOUT terraform:                         }
17:48:03.575 STDOUT terraform:                       + Sid       = ""
17:48:03.575 STDOUT terraform:                     },
17:48:03.575 STDOUT terraform:                 ]
17:48:03.575 STDOUT terraform:               + Version   = "2012-10-17"
17:48:03.575 STDOUT terraform:             }
17:48:03.575 STDOUT terraform:         )
17:48:03.575 STDOUT terraform:       + create_date           = (known after apply)
17:48:03.575 STDOUT terraform:       + force_detach_policies = false
17:48:03.575 STDOUT terraform:       + id                    = (known after apply)
17:48:03.575 STDOUT terraform:       + managed_policy_arns   = (known after apply)
17:48:03.575 STDOUT terraform:       + max_session_duration  = 3600
17:48:03.575 STDOUT terraform:       + name                  = "newrelic_metric_stream_to_firehose_role_staging"
17:48:03.575 STDOUT terraform:       + name_prefix           = (known after apply)
17:48:03.575 STDOUT terraform:       + path                  = "/"
17:48:03.575 STDOUT terraform:       + tags_all              = (known after apply)
17:48:03.575 STDOUT terraform:       + unique_id             = (known after apply)
17:48:03.575 STDOUT terraform:       + inline_policy (known after apply)
17:48:03.576 STDOUT terraform:     }
17:48:03.576 STDOUT terraform:   # aws_iam_role.newrelic_aws_role[0] will be created
17:48:03.576 STDOUT terraform:   + resource "aws_iam_role" "newrelic_aws_role" {
17:48:03.576 STDOUT terraform:       + arn                   = (known after apply)
17:48:03.576 STDOUT terraform:       + assume_role_policy    = jsonencode(
17:48:03.576 STDOUT terraform:             {
17:48:03.576 STDOUT terraform:               + Statement = [
17:48:03.576 STDOUT terraform:                   + {
17:48:03.576 STDOUT terraform:                       + Action    = "sts:AssumeRole"
17:48:03.576 STDOUT terraform:                       + Condition = {
17:48:03.576 STDOUT terraform:                           + StringEquals = {
17:48:03.576 STDOUT terraform:                               + "sts:ExternalId" = "2691974"
17:48:03.576 STDOUT terraform:                             }
17:48:03.576 STDOUT terraform:                         }
17:48:03.576 STDOUT terraform:                       + Effect    = "Allow"
17:48:03.576 STDOUT terraform:                       + Principal = {
17:48:03.576 STDOUT terraform:                           + AWS = "754728514883"
17:48:03.576 STDOUT terraform:                         }
17:48:03.576 STDOUT terraform:                     },
17:48:03.576 STDOUT terraform:                 ]
17:48:03.576 STDOUT terraform:               + Version   = "2012-10-17"
17:48:03.576 STDOUT terraform:             }
17:48:03.576 STDOUT terraform:         )
17:48:03.576 STDOUT terraform:       + create_date           = (known after apply)
17:48:03.576 STDOUT terraform:       + description           = "New Relic Cloud integration role"
17:48:03.576 STDOUT terraform:       + force_detach_policies = false
17:48:03.576 STDOUT terraform:       + id                    = (known after apply)
17:48:03.576 STDOUT terraform:       + managed_policy_arns   = (known after apply)
17:48:03.576 STDOUT terraform:       + max_session_duration  = 3600
17:48:03.576 STDOUT terraform:       + name                  = "NewRelicInfrastructure-Integrations-staging"
17:48:03.576 STDOUT terraform:       + name_prefix           = (known after apply)
17:48:03.577 STDOUT terraform:       + path                  = "/"
17:48:03.577 STDOUT terraform:       + tags_all              = (known after apply)
17:48:03.577 STDOUT terraform:       + unique_id             = (known after apply)
17:48:03.577 STDOUT terraform:       + inline_policy (known after apply)
17:48:03.577 STDOUT terraform:     }
17:48:03.577 STDOUT terraform:   # aws_iam_role.newrelic_configuration_recorder[0] will be created
17:48:03.577 STDOUT terraform:   + resource "aws_iam_role" "newrelic_configuration_recorder" {
17:48:03.577 STDOUT terraform:       + arn                   = (known after apply)
17:48:03.577 STDOUT terraform:       + assume_role_policy    = jsonencode(
17:48:03.577 STDOUT terraform:             {
17:48:03.577 STDOUT terraform:               + Statement = [
17:48:03.577 STDOUT terraform:                   + {
17:48:03.577 STDOUT terraform:                       + Action    = "sts:AssumeRole"
17:48:03.577 STDOUT terraform:                       + Effect    = "Allow"
17:48:03.577 STDOUT terraform:                       + Principal = {
17:48:03.577 STDOUT terraform:                           + Service = "config.amazonaws.com"
17:48:03.577 STDOUT terraform:                         }
17:48:03.577 STDOUT terraform:                       + Sid       = ""
17:48:03.577 STDOUT terraform:                     },
17:48:03.577 STDOUT terraform:                 ]
17:48:03.577 STDOUT terraform:               + Version   = "2012-10-17"
17:48:03.577 STDOUT terraform:             }
17:48:03.577 STDOUT terraform:         )
17:48:03.577 STDOUT terraform:       + create_date           = (known after apply)
17:48:03.577 STDOUT terraform:       + force_detach_policies = false
17:48:03.577 STDOUT terraform:       + id                    = (known after apply)
17:48:03.577 STDOUT terraform:       + managed_policy_arns   = (known after apply)
17:48:03.577 STDOUT terraform:       + max_session_duration  = 3600
17:48:03.577 STDOUT terraform:       + name                  = "newrelic_configuration_recorder-staging"
17:48:03.578 STDOUT terraform:       + name_prefix           = (known after apply)
17:48:03.578 STDOUT terraform:       + path                  = "/"
17:48:03.578 STDOUT terraform:       + tags_all              = (known after apply)
17:48:03.578 STDOUT terraform:       + unique_id             = (known after apply)
17:48:03.578 STDOUT terraform:       + inline_policy (known after apply)
17:48:03.578 STDOUT terraform:     }
17:48:03.578 STDOUT terraform:   # aws_iam_role_policy.metric_stream_to_firehose[0] will be created
17:48:03.578 STDOUT terraform:   + resource "aws_iam_role_policy" "metric_stream_to_firehose" {
17:48:03.578 STDOUT terraform:       + id          = (known after apply)
17:48:03.578 STDOUT terraform:       + name        = "default"
17:48:03.578 STDOUT terraform:       + name_prefix = (known after apply)
17:48:03.578 STDOUT terraform:       + policy      = (known after apply)
17:48:03.578 STDOUT terraform:       + role        = (known after apply)
17:48:03.578 STDOUT terraform:     }
17:48:03.578 STDOUT terraform:   # aws_iam_role_policy.newrelic_configuration_recorder_s3[0] will be created
17:48:03.578 STDOUT terraform:   + resource "aws_iam_role_policy" "newrelic_configuration_recorder_s3" {
17:48:03.578 STDOUT terraform:       + id          = (known after apply)
17:48:03.578 STDOUT terraform:       + name        = "newrelic-configuration-recorder-s3-staging"
17:48:03.578 STDOUT terraform:       + name_prefix = (known after apply)
17:48:03.578 STDOUT terraform:       + policy      = (known after apply)
17:48:03.578 STDOUT terraform:       + role        = (known after apply)
17:48:03.578 STDOUT terraform:     }
17:48:03.578 STDOUT terraform:   # aws_iam_role_policy_attachment.newrelic_aws_policy_attach[0] will be created
17:48:03.578 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "newrelic_aws_policy_attach" {
17:48:03.578 STDOUT terraform:       + id         = (known after apply)
17:48:03.578 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
17:48:03.579 STDOUT terraform:       + role       = "NewRelicInfrastructure-Integrations-staging"
17:48:03.579 STDOUT terraform:     }
17:48:03.579 STDOUT terraform:   # aws_iam_role_policy_attachment.newrelic_configuration_recorder[0] will be created
17:48:03.579 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "newrelic_configuration_recorder" {
17:48:03.579 STDOUT terraform:       + id         = (known after apply)
17:48:03.579 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AWS_ConfigRole"
17:48:03.579 STDOUT terraform:       + role       = "newrelic_configuration_recorder-staging"
17:48:03.579 STDOUT terraform:     }
17:48:03.579 STDOUT terraform:   # aws_kinesis_firehose_delivery_stream.newrelic_firehose_stream[0] will be created
17:48:03.579 STDOUT terraform:   + resource "aws_kinesis_firehose_delivery_stream" "newrelic_firehose_stream" {
17:48:03.579 STDOUT terraform:       + arn            = (known after apply)
17:48:03.579 STDOUT terraform:       + destination    = "http_endpoint"
17:48:03.579 STDOUT terraform:       + destination_id = (known after apply)
17:48:03.579 STDOUT terraform:       + id             = (known after apply)
17:48:03.579 STDOUT terraform:       + name           = "newrelic_firehose_stream_staging"
17:48:03.579 STDOUT terraform:       + region         = "ca-central-1"
17:48:03.579 STDOUT terraform:       + tags_all       = (known after apply)
17:48:03.579 STDOUT terraform:       + version_id     = (known after apply)
17:48:03.579 STDOUT terraform:       + http_endpoint_configuration {
17:48:03.579 STDOUT terraform:           + access_key         = (sensitive value)
17:48:03.579 STDOUT terraform:           + buffering_interval = 60
17:48:03.579 STDOUT terraform:           + buffering_size     = 1
17:48:03.579 STDOUT terraform:           + name               = "New Relic staging"
17:48:03.579 STDOUT terraform:           + retry_duration     = 300
17:48:03.579 STDOUT terraform:           + role_arn           = (known after apply)
17:48:03.580 STDOUT terraform:           + s3_backup_mode     = "FailedDataOnly"
17:48:03.580 STDOUT terraform:           + url                = "https://aws-api.newrelic.com/cloudwatch-metrics/v1"
17:48:03.580 STDOUT terraform:           + cloudwatch_logging_options (known after apply)
17:48:03.580 STDOUT terraform:           + request_configuration {
17:48:03.580 STDOUT terraform:               + content_encoding = "GZIP"
17:48:03.580 STDOUT terraform:             }
17:48:03.580 STDOUT terraform:           + s3_configuration {
17:48:03.580 STDOUT terraform:               + bucket_arn         = (known after apply)
17:48:03.580 STDOUT terraform:               + buffering_interval = 400
17:48:03.580 STDOUT terraform:               + buffering_size     = 10
17:48:03.580 STDOUT terraform:               + compression_format = "GZIP"
17:48:03.580 STDOUT terraform:               + role_arn           = (known after apply)
17:48:03.580 STDOUT terraform:               + cloudwatch_logging_options (known after apply)
17:48:03.580 STDOUT terraform:             }
17:48:03.580 STDOUT terraform:           + secrets_manager_configuration (known after apply)
17:48:03.580 STDOUT terraform:         }
17:48:03.580 STDOUT terraform:     }
17:48:03.580 STDOUT terraform:   # aws_s3_bucket.newrelic_aws_bucket[0] will be created
17:48:03.580 STDOUT terraform:   + resource "aws_s3_bucket" "newrelic_aws_bucket" {
17:48:03.580 STDOUT terraform:       + acceleration_status         = (known after apply)
17:48:03.580 STDOUT terraform:       + acl                         = (known after apply)
17:48:03.580 STDOUT terraform:       + arn                         = (known after apply)
17:48:03.580 STDOUT terraform:       + bucket                      = (known after apply)
17:48:03.580 STDOUT terraform:       + bucket_domain_name          = (known after apply)
17:48:03.580 STDOUT terraform:       + bucket_prefix               = (known after apply)
17:48:03.580 STDOUT terraform:       + bucket_region               = (known after apply)
17:48:03.580 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
17:48:03.580 STDOUT terraform:       + force_destroy               = true
17:48:03.581 STDOUT terraform:       + hosted_zone_id              = (known after apply)
17:48:03.581 STDOUT terraform:       + id                          = (known after apply)
17:48:03.581 STDOUT terraform:       + object_lock_enabled         = (known after apply)
17:48:03.581 STDOUT terraform:       + policy                      = (known after apply)
17:48:03.581 STDOUT terraform:       + region                      = "ca-central-1"
17:48:03.581 STDOUT terraform:       + request_payer               = (known after apply)
17:48:03.581 STDOUT terraform:       + tags_all                    = (known after apply)
17:48:03.581 STDOUT terraform:       + website_domain              = (known after apply)
17:48:03.581 STDOUT terraform:       + website_endpoint            = (known after apply)
17:48:03.581 STDOUT terraform:       + cors_rule (known after apply)
17:48:03.581 STDOUT terraform:       + grant (known after apply)
17:48:03.581 STDOUT terraform:       + lifecycle_rule (known after apply)
17:48:03.581 STDOUT terraform:       + logging (known after apply)
17:48:03.581 STDOUT terraform:       + object_lock_configuration (known after apply)
17:48:03.581 STDOUT terraform:       + replication_configuration (known after apply)
17:48:03.581 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
17:48:03.581 STDOUT terraform:       + versioning (known after apply)
17:48:03.581 STDOUT terraform:       + website (known after apply)
17:48:03.581 STDOUT terraform:     }
17:48:03.581 STDOUT terraform:   # aws_s3_bucket.newrelic_configuration_recorder_s3[0] will be created
17:48:03.581 STDOUT terraform:   + resource "aws_s3_bucket" "newrelic_configuration_recorder_s3" {
17:48:03.581 STDOUT terraform:       + acceleration_status         = (known after apply)
17:48:03.581 STDOUT terraform:       + acl                         = (known after apply)
17:48:03.581 STDOUT terraform:       + arn                         = (known after apply)
17:48:03.581 STDOUT terraform:       + bucket                      = (known after apply)
17:48:03.581 STDOUT terraform:       + bucket_domain_name          = (known after apply)
17:48:03.582 STDOUT terraform:       + bucket_prefix               = (known after apply)
17:48:03.582 STDOUT terraform:       + bucket_region               = (known after apply)
17:48:03.582 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
17:48:03.582 STDOUT terraform:       + force_destroy               = true
17:48:03.582 STDOUT terraform:       + hosted_zone_id              = (known after apply)
17:48:03.582 STDOUT terraform:       + id                          = (known after apply)
17:48:03.582 STDOUT terraform:       + object_lock_enabled         = (known after apply)
17:48:03.582 STDOUT terraform:       + policy                      = (known after apply)
17:48:03.582 STDOUT terraform:       + region                      = "ca-central-1"
17:48:03.582 STDOUT terraform:       + request_payer               = (known after apply)
17:48:03.582 STDOUT terraform:       + tags_all                    = (known after apply)
17:48:03.582 STDOUT terraform:       + website_domain              = (known after apply)
17:48:03.582 STDOUT terraform:       + website_endpoint            = (known after apply)
17:48:03.582 STDOUT terraform:       + cors_rule (known after apply)
17:48:03.582 STDOUT terraform:       + grant (known after apply)
17:48:03.582 STDOUT terraform:       + lifecycle_rule (known after apply)
17:48:03.582 STDOUT terraform:       + logging (known after apply)
17:48:03.582 STDOUT terraform:       + object_lock_configuration (known after apply)
17:48:03.582 STDOUT terraform:       + replication_configuration (known after apply)
17:48:03.582 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
17:48:03.582 STDOUT terraform:       + versioning (known after apply)
17:48:03.582 STDOUT terraform:       + website (known after apply)
17:48:03.582 STDOUT terraform:     }
17:48:03.582 STDOUT terraform:   # aws_s3_bucket_ownership_controls.newrelic_ownership_controls[0] will be created
17:48:03.582 STDOUT terraform:   + resource "aws_s3_bucket_ownership_controls" "newrelic_ownership_controls" {
17:48:03.582 STDOUT terraform:       + bucket = (known after apply)
17:48:03.582 STDOUT terraform:       + id     = (known after apply)
17:48:03.582 STDOUT terraform:       + region = "ca-central-1"
17:48:03.582 STDOUT terraform:       + rule {
17:48:03.583 STDOUT terraform:           + object_ownership = "BucketOwnerEnforced"
17:48:03.583 STDOUT terraform:         }
17:48:03.583 STDOUT terraform:     }
17:48:03.583 STDOUT terraform:   # aws_sns_sms_preferences.update-sms-prefs-us-west-2 will be updated in-place
17:48:03.583 STDOUT terraform:   ~ resource "aws_sns_sms_preferences" "update-sms-prefs-us-west-2" {
17:48:03.583 STDOUT terraform:         id                                    = "aws_sns_sms_id"
17:48:03.583 STDOUT terraform:       ~ monthly_spend_limit                   = 30 -> 300
17:48:03.583 STDOUT terraform:         # (6 unchanged attributes hidden)
17:48:03.583 STDOUT terraform:     }
17:48:03.583 STDOUT terraform:   # newrelic_api_access_key.newrelic_aws_access_key[0] will be created
17:48:03.583 STDOUT terraform:   + resource "newrelic_api_access_key" "newrelic_aws_access_key" {
17:48:03.583 STDOUT terraform:       + account_id  = (sensitive value)
17:48:03.583 STDOUT terraform:       + id          = (known after apply)
17:48:03.583 STDOUT terraform:       + ingest_type = (known after apply)
17:48:03.583 STDOUT terraform:       + key         = (known after apply)
17:48:03.583 STDOUT terraform:       + key_type    = "USER"
17:48:03.583 STDOUT terraform:       + name        = "notify_tf_provider"
17:48:03.583 STDOUT terraform:       + notes       = "Used by Notify Terraform Code to create New Relic Resources"
17:48:03.583 STDOUT terraform:       + user_id     = (sensitive value)
17:48:03.583 STDOUT terraform:     }
17:48:03.583 STDOUT terraform:   # newrelic_cloud_aws_integrations.newrelic_cloud_integration_pull[0] will be created
17:48:03.583 STDOUT terraform:   + resource "newrelic_cloud_aws_integrations" "newrelic_cloud_integration_pull" {
17:48:03.583 STDOUT terraform:       + account_id        = (sensitive value)
17:48:03.583 STDOUT terraform:       + id                = (known after apply)
17:48:03.583 STDOUT terraform:       + linked_account_id = (known after apply)
17:48:03.583 STDOUT terraform:       + lambda {
17:48:03.583 STDOUT terraform:           + fetch_tags               = true
17:48:03.583 STDOUT terraform:           + metrics_polling_interval = 300
17:48:03.583 STDOUT terraform:         }
17:48:03.583 STDOUT terraform:     }
17:48:03.583 STDOUT terraform:   # newrelic_cloud_aws_link_account.newrelic_cloud_integration_pull[0] will be created
17:48:03.583 STDOUT terraform:   + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_pull" {
17:48:03.583 STDOUT terraform:       + account_id             = (sensitive value)
17:48:03.583 STDOUT terraform:       + arn                    = (known after apply)
17:48:03.583 STDOUT terraform:       + id                     = (known after apply)
17:48:03.583 STDOUT terraform:       + metric_collection_mode = "PULL"
17:48:03.583 STDOUT terraform:       + name                   = "staging pull"
17:48:03.583 STDOUT terraform:     }
17:48:03.583 STDOUT terraform:   # newrelic_cloud_aws_link_account.newrelic_cloud_integration_push[0] will be created
17:48:03.583 STDOUT terraform:   + resource "newrelic_cloud_aws_link_account" "newrelic_cloud_integration_push" {
17:48:03.583 STDOUT terraform:       + account_id             = (sensitive value)
17:48:03.583 STDOUT terraform:       + arn                    = (known after apply)
17:48:03.584 STDOUT terraform:       + id                     = (known after apply)
17:48:03.584 STDOUT terraform:       + metric_collection_mode = "PUSH"
17:48:03.584 STDOUT terraform:       + name                   = "staging metric stream"
17:48:03.584 STDOUT terraform:     }
17:48:03.584 STDOUT terraform:   # random_string.s3-bucket-name[0] will be created
17:48:03.584 STDOUT terraform:   + resource "random_string" "s3-bucket-name" {
17:48:03.584 STDOUT terraform:       + id          = (known after apply)
17:48:03.584 STDOUT terraform:       + length      = 8
17:48:03.584 STDOUT terraform:       + lower       = true
17:48:03.584 STDOUT terraform:       + min_lower   = 0
17:48:03.584 STDOUT terraform:       + min_numeric = 0
17:48:03.584 STDOUT terraform:       + min_special = 0
17:48:03.584 STDOUT terraform:       + min_upper   = 0
17:48:03.584 STDOUT terraform:       + number      = true
17:48:03.584 STDOUT terraform:       + numeric     = true
17:48:03.584 STDOUT terraform:       + result      = (known after apply)
17:48:03.584 STDOUT terraform:       + special     = false
17:48:03.584 STDOUT terraform:       + upper       = false
17:48:03.584 STDOUT terraform:     }
17:48:03.584 STDOUT terraform: Plan: 19 to add, 1 to change, 0 to destroy.
17:48:03.584 STDOUT terraform: Warning: Argument is deprecated
17:48:03.584 STDOUT terraform:   with aws_s3_bucket.csv_bucket,
17:48:03.584 STDOUT terraform:   on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
17:48:03.584 STDOUT terraform:    5: resource "aws_s3_bucket" "csv_bucket" {
17:48:03.584 STDOUT terraform: lifecycle_rule is deprecated. Use the aws_s3_bucket_lifecycle_configuration
17:48:03.584 STDOUT terraform: resource instead.
17:48:03.584 STDOUT terraform: (and 61 more similar warnings elsewhere)
17:48:03.584 STDOUT terraform: Warning: Deprecated attribute
17:48:03.584 STDOUT terraform:   on .terraform/modules/notify_slack_critical.lambda/outputs.tf line 9, in output "lambda_function_arn_static":
17:48:03.584 STDOUT terraform:    9:   value       = local.create && var.create_function && !var.create_layer ? "arn:aws:lambda:${data.aws_region.current.name}:${data.aws_caller_identity.current.account_id}:function:${var.function_name}" : ""
17:48:03.584 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
17:48:03.584 STDOUT terraform: details.
17:48:03.584 STDOUT terraform: (and 17 more similar warnings...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.cloudwatch_data_scanned"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
